Revit 2024 API
BuiltInFailures.RevolutionFailures Class
 Failures about Revolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class RevolutionFailures
Visual Basic
Public NotInheritable Class RevolutionFailures
Visual C++
public ref class RevolutionFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures
See Also
BuiltInFailures.RevolutionFailures Members
Autodesk.Revit.DB Namespace